
# 집어 넣은 순서대로 출력되지 않는다.
# 중복을 허용하지 않는다.

# 집합 set자료형
s1 = set([1,2,3])
s1  # {1, 2, 3}

s2 = set("Hello")  # 중복제거
s2 # {'e', 'l', 'H', 'o'}

# 집합set을 리스트로 전환
s1 = set([1,2,3])
l1 = list(s1)
l1   # [1, 2, 3]
# 집합set을 튜플로 전환
t1 = tuple(s1)
t1  # (1, 2, 3)

# 집합 연산하기
s1 = set([1,2,3,4,5,6])
s2 = set([4,5,6,7,8,9])
# 1)교집합 : &  intersection()
s1 & s2  # {4, 5, 6}
s1.intersection(s2)  # {4, 5, 6}
# 2)합집합 : |  union()
s1 | s2  # {1, 2, 3, 4, 5, 6, 7, 8, 9}
s1.union(s2)  # {1, 2, 3, 4, 5, 6, 7, 8, 9}
# 3)차집합 : -  difference()
s1 - s2  # {1, 2, 3}
s2 - s1  # {8, 9, 7}
s1.difference(s2)
s2.difference(s1)

# 집합관련 함수
# add() : 값 1개 추가
s1 = set([1,2,3])
s1.add(4)
s1  # {1, 2, 3, 4}
# update() : 값 여러개 추가
s1 = set([1,2,3])
s1.update([4,5,6])
s1  # {1, 2, 3, 4, 5, 6}
# remove() : 특정 값 제거
s1 = set([1,2,3])
s1.remove(2)  # 집합 안의 요소들 중 2 삭제
s1


